src/main/resources/templates/CreateCLientV4.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <ns2:CreateClientV4 xmlns:ns2="http://www.openwaygroup.com/wsint">
            <ns2:Reason>Create client</ns2:Reason>
            <ns2:CreateClient_InObject>
                <ns2:InstitutionCode>0001</ns2:InstitutionCode>
                <ns2:Branch>001</ns2:Branch>
                <ns2:ClientTypeCode>PR</ns2:ClientTypeCode>
                <ns2:ShortName>Truong Ha Anh</ns2:ShortName>
                <ns2:FirstName>Anh</ns2:FirstName>
                <ns2:LastName>Truong</ns2:LastName>
                <ns2:MiddleName>Ha</ns2:MiddleName>
                <ns2:MaritalStatusCode>D</ns2:MaritalStatusCode>
                <ns2:SocialSecurityNumber>234550004319</ns2:SocialSecurityNumber>
                <ns2:SalutationCode>MR</ns2:SalutationCode>
                <ns2:BirthDate>2000-12-12</ns2:BirthDate>
                <ns2:Gender>F</ns2:Gender>
                <ns2:Citizenship>VNM</ns2:Citizenship>
                <ns2:IndividualTaxpayerNumber>43245665619</ns2:IndividualTaxpayerNumber>
                <ns2:CompanyName>OpenWay</ns2:CompanyName>
                <ns2:IdentityCardNumber>0997765539</ns2:IdentityCardNumber>
                <ns2:IdentityCardDetails>232445213hanoi</ns2:IdentityCardDetails>
                <ns2:ClientNumber>099773245419</ns2:ClientNumber>
                <ns2:Profession>Thu Ky</ns2:Profession>
                <ns2:AddressLine1>54 Lieu Giai Doi Can Ba Dinh</ns2:AddressLine1>
                <ns2:City>HaNoi</ns2:City>
                <ns2:HomePhone>0875433001</ns2:HomePhone>
                <ns2:MobilePhone>087543002</ns2:MobilePhone>
            </ns2:CreateClient_InObject>
            <ns2:SetCustomData_InObject>
                <ns2:AddInfoType>AddInfo01</ns2:AddInfoType>
                <ns2:TagName>PrevID_01</ns2:TagName>
                <ns2:TagValue>A1</ns2:TagValue>
            </ns2:SetCustomData_InObject>
            <ns2:SetCustomData_InObject>
                <ns2:AddInfoType>AddInfo01</ns2:AddInfoType>
                <ns2:TagName>PrevID_02</ns2:TagName>
                <ns2:TagValue>A2</ns2:TagValue>
            </ns2:SetCustomData_InObject>
        </ns2:CreateClientV4>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
